"""
Задан массив из 10 чисел, написать программу которая, выводит их сумму.

1) Входные данные: 0, 1, 2, 3, 4, 5, 6, 7, 8, 9. Выходные данные: 45
2) Входные данные: 1, 1, 1, 1, 1, 1, 1, 1, 1, 1. Выходные данные: 10
3) Входные данные: 8, 4, 5, 3, 9, 2, 3, 4, 5, 1. Выходные данные: 44
4) Входные данные: 758, 483, 893, 393, 293, 292, 292, 485, 828, 182. Выходные данные: 4899
"""
u_ar1 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
u_ar2 = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
u_ar3 = [8, 4, 5, 3, 9, 2, 3, 4, 5, 1]
u_ar4 = [758, 483, 893, 393, 293, 292, 292, 485, 828, 182]
u_ar = [u_ar1, u_ar2, u_ar3, u_ar4]
u_l_s_a = []
tax1, tax2, tax3, tax4 = 0, 0, 0, 0
for i in u_ar[0]:
    tax1 += i
u_l_s_a.append(tax1)
print(tax1)
for i in u_ar[1]:
    tax2 += i
u_l_s_a.append(tax2)
print(tax2)
for i in u_ar[2]:
    tax3 += i
u_l_s_a.append(tax3)
print(tax3)
for i in u_ar[3]:
    tax4 += i
u_l_s_a.append(tax4)
print(tax4)
print(u_l_s_a)